
#include <iostream>
#include <cmath>

int main()
{
    setlocale(LC_ALL, "Russian");

    double x1, y1, x2, y2, x3, y3;
    std::cin >> x1 >> y1 >> x2 >> y2 >> x3 >> y3;

    if ((x1 - x2) / (x2 - x3) == (y1 - y2) / (y2 - y3)) {
        std::cout << "Треугольника с такими точками не существует";
    } else {
        //длины сторон
        double c1, c2, c3;
        c1 = sqrt(pow((x1 - x2), 2) + pow((y1 - y2), 2));
        c2 = sqrt(pow((x3 - x2), 2) + pow((y3 - y2), 2));
        c3 = sqrt(pow((x1 - x3), 2) + pow((y1 - y3), 2));
        std::cout << "длина стороны AB =" << c1 << '\n';
        std::cout << "длина стороны BC =" << c2 << '\n';
        std::cout << "длина стороны AC =" << c3 << '\n';
        
        //полупериметр и площадь
        double p = (c1 + c2 + c3) / 2;
        double s = sqrt(p * (p - c1) * (p - c2) * (p - c3));

        //высоты
        double h1, h2, h3;
        h1 = 2 * s / c1;
        h2 = 2 * s / c2;
        h3 = 2 * s / c3;
        std::cout << "длина высоты к AB =" << h1 << '\n';
        std::cout << "длина высоты к BC =" << h2 << '\n';
        std::cout << "длина высоты к AC =" << h3 << '\n';

        //медианы
        double m1, m2, m3;
        m1 = sqrt(2 * c2 * c2 + 2 * c3 * c3 - c1 * c1) / 2;
        m2 = sqrt(2 * c1 * c1 + 2 * c3 * c3 - c2 * c2) / 2;
        m3 = sqrt(2 * c2 * c2 + 2 * c1 * c1 - c3 * c3) / 2;
        std::cout << "длина медианы к AB =" << m1 << '\n';
        std::cout << "длина медианы к BC =" << m2 << '\n';
        std::cout << "длина медианы к AC =" << m3 << '\n';
        return 0;
        //углы в радианах
        double a1, a2, a3;
        a1 = acos((c2 * c2 + c3 * c3 - c1 * c1) / 2 / c2 / c3);
        a2 = acos((c1 * c1 + c3 * c3 - c2 * c2) / 2 / c1 / c3);
        a3 = acos((c2 * c2 + c1 * c1 - c3 * c3) / 2 / c2 / c1);
        std::cout << "радианная мера угла ACB =" << a1 << '\n';
        std::cout << "радианная мера угла BAC =" << a2 << '\n';
        std::cout << "радианная мера угла ABC =" << a3 << '\n';

        //углы в градусах
        std::cout << "градусная мера угла ACB =" << a1 * 180 / (atan(1) * 4) << '\n';
        std::cout << "градусная мера угла BAC =" << a2 * 180 / (atan(1) * 4) << '\n';
        std::cout << "градусная мера угла ABC =" << a3 * 180 / (atan(1) * 4) << '\n';

        //радиусы
        double R, r;
        R = c1 / 2 / sin(a1);
        r = s / p;
        std::cout << "Радиус описанной окружности =" << R << '\n';
        std::cout << "Радиус вписанной окружности =" << r << '\n';

        std::cout << "Площадь описанной окружности =" << atan(1) * 4 * R * R << '\n';
        std::cout << "Площадь вписанной окружности =" << atan(1) * 4 * r * r << '\n';

        std::cout << "Длина описанной окружности =" << atan(1) * 8 * R << '\n';
        std::cout << "Длина вписанной окружности =" << atan(1) * 8 * r << '\n';

        //периметр и площади
        std::cout << "Периметр =" << p * 2 << '\n';
        std::cout << "площадь через Герона =" << s << '\n';
        std::cout << "площадь через синус =" << sin(a1) * c2 * c3 / 2 << '\n';
        std::cout << "площадь через Радиус описанной окружности =" << c1 * c2 * c3 / 4 / R << '\n';
    }
    return 0;
}


